import { Brain, ChartNoAxesCombined, Rocket, Target, Zap } from '@lucide/vue'

export const START_TILES = [
  {
    title: 'Превратить идею в проект',
    query:
      'Создай пошаговый план и структуру канбан-доски для моего проекта: [опиши коротко свою идею или цель]. Разбей процесс на логические колонки и конкретные задачи',
    iconComponent: Rocket,
  },
  {
    title: 'Спланировать спринт на неделю',
    query:
      'Помоги спланировать задачи на ближайшую неделю. Вот мои главные фокусы и дела: [перечисли ключевые задачи или сферы]. Разбей их по приоритетам и дням',
    iconComponent: Zap,
  },
  {
    title: 'Декомпозировать цель',
    query:
      'У меня есть большая цель: [напиши цель, например: «Подготовить презентацию для инвесторов»]. Декомпозируй её на мелкие, простые и понятные действия, которые легко начать делать. Разбей действия на задачи и создай соответствующие колонки',
    iconComponent: Target,
  },
  {
    title: 'Составить Roadmap для проекта',
    query:
      'Сформируй дорожную карту (Roadmap) для [укажи проект, продукт или событие]. Разбей работу на основные фазы от подготовки до релиза и укажи ключевые контрольные точки (milestones)',
    iconComponent: ChartNoAxesCombined,
  },
  {
    title: 'Организовать хаос в задачи',
    query:
      'Я выгружу ниже свои мысли, заметки и идеи в свободной форме. Разбери этот хаос, отфильтруй главное, сгруппируй по направлениям и сделай из этого список задач:',
    iconComponent: Brain,
  },
]
